balazsplaszkony/Obstacle-Avoiding-Car/LPC845_Project/source/encoder.h
/*
 * encoder.h
 *
 *  Created on: 2023. márc. 23.
 *      Author: plasz
 */

#ifndef ENCODER_H_
#define ENCODER_H_
#include <stdbool.h>
#include <stdint.h>
#include <string.h>


#include "peripherals.h"
#include "fsl_debug_console.h"


#define MicroSecondsInMinute 60000000
#define Resolution 20
#define RPMCONST (MicroSecondsInMinute * Resolution)
#define MAX_RPM 200 //üresjárásban ennyi
#define MIN_RPM 20
#define Maximum_Tolerated_RPM_Drop 50
#define FILTER_CUTOFF_FREQ 10.0f // Cutoff frequency in Hz
#define M_PI 3.14159f // Cutoff frequency in Hz

typedef struct Encoder {
    volatile float RPM;
    volatile float RPM_prev;
    volatile bool updated;
} Encoder;

extern volatile Encoder Encoder_right;
extern volatile Encoder Encoder_left;

void InitEncoder(volatile Encoder* encoder);
void EncoderRightCallback(uint32_t flags);
void EncoderLeftCallback(uint32_t flags);
float lowPassFilter(float input, float prevOutput, float deltaTime, float cutoffFreq);
void EncoderTimerHandler(uint32_t flags);
void HandleNoEncoderSignal(volatile Encoder* encoder);


#endif /* ENCODER_H_ */
